package sqc.enums;

/**
 * @Description: 调用第三方服务出错
 * @Author: Sqcode
 * @Date: 2021/5/21 10:29
 */
public enum CallThirdPartsErrorTypeEnum {
//    - C0001 调用第三方服务出错 一级宏观错误码
//    C0100 中间件服务出错 二级宏观错误码
//    C0110 RPC服务出错
//    C0111 RPC服务未找到
//    C0112 RPC服务未注册
//    C0113 接口不存在
//    C0120 消息服务出错
//    C0121 消息投递出错
//    C0122 消息消费出错
//    C0123 消息订阅出错
//    C0124 消息分组未查到
//    Java 开发手册
//59/59
//    C0130 缓存服务出错
//    C0131 key长度超过限制
//    C0132 value长度超过限制
//    C0133 存储容量已满
//    C0134 不支持的数据格式
//    C0140 配置服务出错
//    C0150 网络资源服务出错
//    C0151 VPN服务出错
//    C0152 CDN服务出错
//    C0153 域名解析服务出错
//    C0154 网关服务出错
//    C0200 第三方系统执行超时 二级宏观错误码
//    C0210 RPC执行超时
//    C0220 消息投递超时
//    C0230 缓存服务超时
//    C0240 配置服务超时
//    C0250 数据库服务超时
//    C0300 数据库服务出错 二级宏观错误码
//    C0311 表不存在
//    C0312 列不存在
//    C0321 多表关联中存在多个相同名称的列
//    C0331 数据库死锁
//    C0341 主键冲突
//    C0400 第三方容灾系统被触发 二级宏观错误码
//    C0401 第三方系统限流
//    C0402 第三方功能降级
//    C0500 通知服务出错 二级宏观错误码
//    C0501 短信提醒服务失败
//    C0502 语音提醒服务失败
//    C0503 邮件提醒服务失败
}
